Revit 2027 API
ExternalDefinition Properties
The ExternalDefinition type exposes the following members.
Properties
Name | Description
Description |  The description of the parameter. The description will be used as tooltip in the Revit UI including in the properties palette.
GUID | Returns the GUID associated with the shared parameter definition.
HideWhenNoValue |  Indicates whether this parameter should be hidden from the properties palette when it has no value.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name | The user visible name for the parameter.
(Overrides Definition.Name)
OwnerGroup |  Returns or change the group ID of the external parameter definition.
UserModifiable |  Indicates whether the parameter can be modified by the user interface.
Visible | Indicates if the parameter is visible in the Autodesk Revit user interface.
Top
See Also
Reference
ExternalDefinition Class
Autodesk.Revit.DB Namespace